Documents/си_УстановкаНормВыдачиСпецодеждыИИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>си_УстановкаНормВыдачиСпецодеждыИИнвентаря</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.си_НормыОбеспеченностиСпецодеждойИИнвентарем</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.си_ВидыОперацийУстановкаНормВыдачиСпецодеждыИИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.си_Должности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/си_УстановкаНормВыдачиСпецодеждыИИнвентаря/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ПрограммныйИнтерфейс
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		Возврат;	
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныйПрограммныйИнтерфейс
	
	Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
		
		ДополнительныеПараметрыЗапросов = Новый Структура();
		ДополнительныеПараметрыЗапросов.Вставить("Ссылка", ДокументСсылка);
		
		ДополнительныеЗапросы = Новый Массив;
		ДополнительныеЗапросы.Добавить("НормыВыдачи");
		
		ПараметрыПроведения = си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка,Отказ,Истина,Истина,,,,,ДополнительныеПараметрыЗапросов,ДополнительныеЗапросы);
		
		Возврат ПараметрыПроведения;
		
	КонецФункции 
	
	Функция ТекстЗапросаНормыВыдачи(НомераТаблиц,ПараметрыПроведения, Реквизиты) Экспорт
		НомераТаблиц.Вставить("НормыВыдачи", НомераТаблиц.Количество());
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряРаботники.Сотрудник,
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряДолжности.Должность,
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.Количество,
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.НазначениеИспользования,
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.Номенклатура КАК СпецодеждаИнвентарь
		|ИЗ
		|	Документ.си_УстановкаНормВыдачиСпецодеждыИИнвентаря.НормыВыдачи КАК си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.си_УстановкаНормВыдачиСпецодеждыИИнвентаря.Работники КАК си_УстановкаНормВыдачиСпецодеждыИИнвентаряРаботники
		|		ПО си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.КлючСвязи = си_УстановкаНормВыдачиСпецодеждыИИнвентаряРаботники.КлючСвязи
		|			И си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.Ссылка = си_УстановкаНормВыдачиСпецодеждыИИнвентаряРаботники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.си_УстановкаНормВыдачиСпецодеждыИИнвентаря.Должности КАК си_УстановкаНормВыдачиСпецодеждыИИнвентаряДолжности
		|		ПО си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.КлючСвязи = си_УстановкаНормВыдачиСпецодеждыИИнвентаряДолжности.КлючСвязи
		|			И си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.Ссылка = си_УстановкаНормВыдачиСпецодеждыИИнвентаряДолжности.Ссылка
		|ГДЕ
		|	си_УстановкаНормВыдачиСпецодеждыИИнвентаряНормыВыдачи.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса + общ_ПереопределениеПроцедурБККлиентСервер.ТекстРазделителяЗапросовПакета();
		
	КонецФункции
	
	#КонецОбласти
	

#КонецЕсли
